saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAM4_DFP.1.6.1.pdsc
          <feature type="IOs"           n="43"/>
          <feature type="ExtInt"        n="43"/>
          <feature type="Touch"         n="21"/>
          <feature type="I2C"           n="4"/>
          <feature type="UART"          n="4"/>
          <feature type="LCD"           n="23"/>
          <feature type="ADC"           n="7"       m="12"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LC2C'  ***************************** -->
        <device Dname="ATSAM4LC2C">
          <compile    define="__SAM4LC2C__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LC2C.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>

          <feature type="IOs"           n="75"/>
          <feature type="ExtInt"        n="75"/>
          <feature type="Touch"         n="32"/>
          <feature type="I2C"           n="4"/>
          <feature type="UART"          n="4"/>
          <feature type="LCD"           n="40"/>
          <feature type="ADC"           n="15"      m="12"/>
          <feature type="AnalogOther"   n="4"/>
          <feature type="Timer"         n="6"/>
          <feature type="TimerOther"    n="18"                          name="Output Compare channels"/>
          <feature type="TimerOther"    n="12"                          name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LC4A'  ***************************** -->
        <device Dname="ATSAM4LC4A">
          <compile    define="__SAM4LC4A__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LC4A.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>

          <feature type="IOs"           n="27"/>
          <feature type="ExtInt"        n="27"/>
          <feature type="Touch"         n="13"/>
          <feature type="I2C"           n="2"/>
          <feature type="UART"          n="3"/>
          <feature type="LCD"           n="13"/>
          <feature type="ADC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LC4B'  ***************************** -->
        <device Dname="ATSAM4LC4B">
          <compile    define="__SAM4LC4B__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LC4B.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>

          <feature type="IOs"           n="43"/>
          <feature type="ExtInt"        n="43"/>
          <feature type="Touch"         n="21"/>
          <feature type="I2C"           n="4"/>
          <feature type="UART"          n="4"/>
          <feature type="LCD"           n="23"/>
          <feature type="ADC"           n="7"       m="12"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LC4C'  ***************************** -->
        <device Dname="ATSAM4LC4C">
          <compile    define="__SAM4LC4C__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LC4C.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>

          <feature type="IOs"           n="75"/>
          <feature type="ExtInt"        n="75"/>
          <feature type="Touch"         n="32"/>
          <feature type="I2C"           n="4"/>
          <feature type="UART"          n="4"/>
          <feature type="LCD"           n="40"/>
          <feature type="ADC"           n="15"      m="12"/>
          <feature type="AnalogOther"   n="4"/>
          <feature type="Timer"         n="6"/>
          <feature type="TimerOther"    n="18"                          name="Output Compare channels"/>
          <feature type="TimerOther"    n="12"                          name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LC8A'  ***************************** -->
        <device Dname="ATSAM4LC8A">
          <compile    define="__SAM4LC8A__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LC8A.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_512.FLM"    start="0x00000000"  size="0x80000"                  default="1"/>

