saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAM4_DFP.1.6.1.pdsc
          <feature type="IOs"           n="43"/>
          <feature type="ExtInt"        n="43"/>
          <feature type="Touch"         n="21"/>
          <feature type="I2C"           n="4"/>
          <feature type="UART"          n="4"/>
          <feature type="LCD"           n="23"/>
          <feature type="ADC"           n="7"       m="12"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LC8B'  ***************************** -->
        <device Dname="ATSAM4LC8B">
          <compile    define="__SAM4LC8B__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LC8B.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_512.FLM"    start="0x00000000"  size="0x80000"                  default="1"/>

          <feature type="IOs"           n="43"/>
          <feature type="ExtInt"        n="43"/>
          <feature type="Touch"         n="21"/>
          <feature type="I2C"           n="4"/>
          <feature type="UART"          n="4"/>
          <feature type="LCD"           n="23"/>
          <feature type="ADC"           n="7"       m="12"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LC8C'  ***************************** -->
        <device Dname="ATSAM4LC8C">
          <compile    define="__SAM4LC8C__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LC8C.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_512.FLM"    start="0x00000000"  size="0x80000"                  default="1"/>

          <feature type="IOs"           n="75"/>
          <feature type="ExtInt"        n="75"/>
          <feature type="Touch"         n="32"/>
          <feature type="I2C"           n="4"/>
          <feature type="UART"          n="4"/>
          <feature type="LCD"           n="40"/>
          <feature type="ADC"           n="15"      m="12"/>
          <feature type="AnalogOther"   n="4"/>
          <feature type="Timer"         n="6"/>
          <feature type="TimerOther"    n="18"                          name="Output Compare channels"/>
          <feature type="TimerOther"    n="12"                          name="Input Capture Channels"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'SAM4LS'  **************************** -->
      <subFamily DsubFamily="SAM4LS">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/Include/SAM4L/sam4l.h"/>
        <book name="Documents/Atmel-42023-ARM-Microcontroller-ATSAM4L-Low-Power-LCD_Datasheet.pdf" title="SAM4L Datasheet"/>
        <description>
The SAM4LS Cortex-M4 processor-based Flash microcontrollers offer the industry’s lowest power consumption
and fastest wake-up. The devices feature an embedded capacitive touch module supported by Microchip QTouch
technology, USB device, and multiple serial communication interfaces. They are ideal for a wide range of
industrial, healthcare and consumer applications.
        </description>

        <feature type="USBD"          n="1"/>
        <feature type="Touch"         n="32"/>
        <feature type="Touch"         n="1"                           name="Hardware QTouch Acquisition"/>
        <feature type="SPI"           n="1"/>
        <feature type="DAC"           n="1"       m="10"/>

        <!-- *************************  Device 'ATSAM4LS2A'  ***************************** -->
        <device Dname="ATSAM4LS2A">
          <compile    define="__SAM4LS2A__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LS2A.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>

          <feature type="IOs"           n="32"/>
          <feature type="ExtInt"        n="32"/>
          <feature type="I2C"           n="2"/>
          <feature type="UART"          n="3"/>
          <feature type="ADC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LS2B'  ***************************** -->
        <device Dname="ATSAM4LS2B">
          <compile    define="__SAM4LS2B__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LS2B.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>

          <feature type="IOs"           n="48"/>
          <feature type="ExtInt"        n="48"/>
          <feature type="I2C"           n="4"/>
          <feature type="UART"          n="4"/>
          <feature type="ADC"           n="7"       m="12"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LS2C'  ***************************** -->
        <device Dname="ATSAM4LS2C">
          <compile    define="__SAM4LS2C__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LS2C.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_128.FLM"    start="0x00000000"  size="0x20000"                  default="1"/>

          <feature type="IOs"           n="80"/>
          <feature type="ExtInt"        n="80"/>
          <feature type="I2C"           n="4"/>
          <feature type="UART"          n="4"/>
          <feature type="ADC"           n="15"      m="12"/>
          <feature type="AnalogOther"   n="4"/>
          <feature type="Timer"         n="6"/>
          <feature type="TimerOther"    n="18"                          name="Output Compare channels"/>
          <feature type="TimerOther"    n="12"                          name="Input Capture Channels"/>
        </device>

