saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAM4_DFP.1.6.1.pdsc
        <!-- *************************  Device 'ATSAM4LS4A'  ***************************** -->
        <device Dname="ATSAM4LS4A">
          <compile    define="__SAM4LS4A__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LS4A.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>

          <feature type="IOs"           n="32"/>
          <feature type="ExtInt"        n="32"/>
          <feature type="I2C"           n="2"/>
          <feature type="UART"          n="3"/>
          <feature type="ADC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LS4B'  ***************************** -->
        <device Dname="ATSAM4LS4B">
          <compile    define="__SAM4LS4B__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LS4B.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>

          <feature type="IOs"           n="48"/>
          <feature type="ExtInt"        n="48"/>
          <feature type="I2C"           n="4"/>
          <feature type="UART"          n="4"/>
          <feature type="ADC"           n="7"       m="12"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LS4C'  ***************************** -->
        <device Dname="ATSAM4LS4C">
          <compile    define="__SAM4LS4C__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LS4C.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_256.FLM"    start="0x00000000"  size="0x40000"                  default="1"/>

          <feature type="IOs"           n="80"/>
          <feature type="ExtInt"        n="80"/>
          <feature type="I2C"           n="4"/>
          <feature type="UART"          n="4"/>
          <feature type="ADC"           n="15"      m="12"/>
          <feature type="AnalogOther"   n="4"/>
          <feature type="Timer"         n="6"/>
          <feature type="TimerOther"    n="18"                          name="Output Compare channels"/>
          <feature type="TimerOther"    n="12"                          name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LS8A'  ***************************** -->
        <device Dname="ATSAM4LS8A">
          <compile    define="__SAM4LS8A__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LS8A.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_512.FLM"    start="0x00000000"  size="0x80000"                  default="1"/>

          <feature type="IOs"           n="32"/>
          <feature type="ExtInt"        n="32"/>
          <feature type="I2C"           n="2"/>
          <feature type="UART"          n="3"/>
          <feature type="ADC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LS8B'  ***************************** -->
        <device Dname="ATSAM4LS8B">
          <compile    define="__SAM4LS8B__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LS8B.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_512.FLM"    start="0x00000000"  size="0x80000"                  default="1"/>

          <feature type="IOs"           n="48"/>
          <feature type="ExtInt"        n="48"/>
          <feature type="I2C"           n="4"/>
          <feature type="UART"          n="4"/>
          <feature type="ADC"           n="7"       m="12"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="Timer"         n="3"/>
          <feature type="TimerOther"    n="9"                           name="Output Compare channels"/>
          <feature type="TimerOther"    n="6"                           name="Input Capture Channels"/>
        </device>

        <!-- *************************  Device 'ATSAM4LS8C'  ***************************** -->
        <device Dname="ATSAM4LS8C">
          <compile    define="__SAM4LS8C__"/>
          <debug      svd="SVD/SAM4L/ATSAM4LS8C.svd"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4L_512.FLM"    start="0x00000000"  size="0x80000"                  default="1"/>

          <feature type="IOs"           n="80"/>
          <feature type="ExtInt"        n="80"/>
          <feature type="I2C"           n="4"/>
          <feature type="UART"          n="4"/>
          <feature type="ADC"           n="15"      m="12"/>
          <feature type="AnalogOther"   n="4"/>
          <feature type="Timer"         n="6"/>
          <feature type="TimerOther"    n="18"                          name="Output Compare channels"/>
          <feature type="TimerOther"    n="12"                          name="Input Capture Channels"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'SAM4N'  **************************** -->
      <subFamily DsubFamily="SAM4N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="100000000"/>
        <compile header="Device/Include/SAM4N/sam4n.h"/>
        <book name="Documents/Atmel_11158_32-bit-Cortex-M4-Microcontroller_SAM4N_Datasheet.pdf" title="SAM4N Datasheet"/>
        <description>
The Microchip SAM4N series comprises the entry point into our portfolio of Flash microcontrollers
based on the ARM Cortex-M4 core.
These microcontrollers feature a 100MHz operating frequency and offer up to 1MB of Flash,
multiple serial communication peripherals and analog capability. This combination of
features—plus low power consumption—makes the Microchip SAM4N series ideal for a wide range
of applications in industrial automation, consumer and appliance, and energy metering markets.
        </description>

        <feature type="I2C"           n="3"/>
        <feature type="Timer"         n="6"/>
        <feature type="PWM"           n="4"/>

