saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAM4_DFP.1.6.1.pdsc
        <feature type="USBD"          n="1"/>
        <feature type="SPI"           n="3"/>
        <feature type="I2C"           n="2"/>
        <feature type="UART"          n="4"/>
        <feature type="ComOther"      n="1"                           name="SSC Interface"/>
        <feature type="SDIO"          n="1"/>
        <feature type="AnalogOther"   n="1"/>
        <feature type="Timer"         n="6"                           name="Timer Counter Channels"/>
        <feature type="PWM"           n="4"/>

        <!-- *************************  Device 'ATSAM4S16B'  ***************************** -->
        <device Dname="ATSAM4S16B">
          <compile    define="__SAM4S16B__"/>
          <debug      svd="SVD/SAM4S/ATSAM4S16B.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4S_1024.FLM"   start="0x00400000"  size="0x100000"                 default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="47"/>
          <feature type="ExtInt"        n="47"/>
          <feature type="ADC"           n="11"      m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>

        <!-- *************************  Device 'ATSAM4S16C'  ***************************** -->
        <device Dname="ATSAM4S16C">
          <compile    define="__SAM4S16C__"/>
          <debug      svd="SVD/SAM4S/ATSAM4S16C.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4S_1024.FLM"   start="0x00400000"  size="0x100000"                 default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="79"/>
          <feature type="ExtInt"        n="79"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ExtBus"        n="1"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>

        <!-- *************************  Device 'ATSAM4S2A'  ***************************** -->
        <device Dname="ATSAM4S2A">
          <compile    define="__SAM4S2A__"/>
          <debug      svd="SVD/SAM4S/ATSAM4S2A.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4S_128.FLM"    start="0x00400000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="34"/>
          <feature type="ExtInt"        n="34"/>
          <feature type="ADC"           n="8"       m="12"/>
        </device>

        <!-- *************************  Device 'ATSAM4S2B'  ***************************** -->
        <device Dname="ATSAM4S2B">
          <compile    define="__SAM4S2B__"/>
          <debug      svd="SVD/SAM4S/ATSAM4S2B.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4S_128.FLM"    start="0x00400000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="47"/>
          <feature type="ExtInt"        n="47"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>

        <!-- *************************  Device 'ATSAM4S2C'  ***************************** -->
        <device Dname="ATSAM4S2C">
          <compile    define="__SAM4S2C__"/>
          <debug      svd="SVD/SAM4S/ATSAM4S2C.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4S_128.FLM"    start="0x00400000"  size="0x20000"                  default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="79"/>
          <feature type="ExtInt"        n="79"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ExtBus"        n="1"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>

        <!-- *************************  Device 'ATSAM4S4A'  ***************************** -->
        <device Dname="ATSAM4S4A">
          <compile    define="__SAM4S4A__"/>
          <debug      svd="SVD/SAM4S/ATSAM4S4A.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4S_256.FLM"    start="0x00400000"  size="0x40000"                  default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="34"/>
          <feature type="ExtInt"        n="34"/>
          <feature type="ADC"           n="8"       m="12"/>
        </device>

        <!-- *************************  Device 'ATSAM4S4B'  ***************************** -->
        <device Dname="ATSAM4S4B">
          <compile    define="__SAM4S4B__"/>
          <debug      svd="SVD/SAM4S/ATSAM4S4B.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4S_256.FLM"    start="0x00400000"  size="0x40000"                  default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="47"/>
          <feature type="ExtInt"        n="47"/>
          <feature type="ADC"           n="8"       m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>

        <!-- *************************  Device 'ATSAM4S4C'  ***************************** -->
        <device Dname="ATSAM4S4C">
          <compile    define="__SAM4S4C__"/>
          <debug      svd="SVD/SAM4S/ATSAM4S4C.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4S_256.FLM"    start="0x00400000"  size="0x40000"                  default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

