saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAM4_DFP.1.6.1.pdsc
          <feature type="IOs"           n="79"/>
          <feature type="ExtInt"        n="79"/>
          <feature type="ADC"           n="11"      m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ExtBus"        n="1"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>

        <!-- *************************  Device 'ATSAM4SD32B'  ***************************** -->
        <device Dname="ATSAM4SD32B">
          <compile    define="__SAM4SD32B__"/>
          <debug      svd="SVD/SAM4S/ATSAM4SD32B.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IROM2"                      start="0x00500000"  size="0x100000"   startup="0"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x28000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4SD_2048.FLM"  start="0x00400000"  size="0x200000"                 default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="47"/>
          <feature type="ExtInt"        n="47"/>
          <feature type="ADC"           n="11"      m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>

        <!-- *************************  Device 'ATSAM4SD32C'  ***************************** -->
        <device Dname="ATSAM4SD32C">
          <compile    define="__SAM4SD32C__"/>
          <debug      svd="SVD/SAM4S/ATSAM4SD32C.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IROM2"                      start="0x00500000"  size="0x100000"   startup="0"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x28000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4SD_2048.FLM"  start="0x00400000"  size="0x200000"                 default="1"/>
          <algorithm  name="Flash/ATSAM4S_GPNVM.FLM"  start="0x1FFFFFF0"  size="0x0010"                   default="0"/>

          <feature type="IOs"           n="79"/>
          <feature type="ExtInt"        n="79"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="ExtBus"        n="1"/>
          <feature type="ComOther"      n="1"                           name="High Speed MCI"/>
        </device>
      </subFamily>

      <!-- ******************************  SAM4SP  ****************************** -->
      <subFamily DsubFamily="SAM4SP">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/SAM4SP/sam4sp.h"/>
        <book name="Documents/doc43020.pdf" title="SAM4SP32A Datasheet"/>
        <description>
With an unprecedented level of integration and performance, the Microchip SAM4SP32A
system-on-chip (SoC) solution is the first ARM Cortex-M4 processor-based device
for the power line communications (PLC) smart metering market.
The SAM4SP32A SoC, a pure digital implementation, complies with the latest Power Line
Intelligent Metering Evolution (PRIME) PLC specification.

The compact SAM4SP32A merges the advantages of a Cortex-M4 processor-based microcontroller (MCU)
with an integrated PLC modem. Take advantage of the powerful Cortex-M4 core, as well as 2MB
of dual-bank Flash memory, 160KB SRAM and operating frequency up to 120MHz.
        </description>
        <!-- ******************************  SAM4SP32A  ****************************** -->
        <device Dname="ATSAM4SP32A">
          <compile    define="__SAM4SP32A__"/>
          <debug      svd="SVD/SAM4SP/ATSAM4SP32A.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IROM2"                      start="0x00500000"  size="0x100000"   startup="0"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x28000"    init   ="0"   default="1"/>
          <algorithm  name="Flash/ATSAM4SP_2048.FLM"  start="0x00400000"  size="0x200000"                 default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'SAM4E'  **************************** -->
      <subFamily DsubFamily="SAM4E">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
        <compile header="Device/Include/SAM4E/sam4e.h"/>
        <book name="Documents/Atmel_11157_32-bit-Cortex-M4-Microcontroller_SAM4E8-SAM4E16_Datasheet.pdf" title="SAM4E Datasheet"/>
        <description>
The Microchip SAM4E series of Flash microcontrollers (MCUs) is based on the high-performance
32-bit ARM Cortex-M4 RISC processor with floating point unit (FPU).
It operates at a maximum speed of 120MHz and features up to 1024KB of Flash,
2KB of cache memory and up to 128KB of SRAM.
The SAM4E series offers a rich set of advanced connectivity peripherals including
10/100Mbps Ethernet MAC supporting IEEE 1588 and dual CAN. With a single-precision FPU,
advanced analog features as well as a full set of timing and control functions, SAM4E MCUs
are ideal for industrial automation and building control applications.
        </description>

        <feature type="USBD"          n="1"/>
        <feature type="Other"         n="1"                           name="Quadrature Decoder Channels"/>
        <feature type="SPI"           n="3"/>
        <feature type="I2C"           n="2"/>
        <feature type="UART"          n="4"/>
        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="SDIO"          n="1"/>
        <feature type="AnalogOther"   n="1"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="Crypto"        n="1"       m="256"/>
        <feature type="PWM"           n="4"/>

