saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAM4_DFP.1.6.1.pdsc
        <!-- ******************************  SAM4CMS8C  ****************************** -->
        <device Dname="ATSAM4CMS8C">
          <compile   Pname="CM4_P0" define="__SAM4CMS8C_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4CMS8C_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4CM/ATSAM4CMS8C_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4CM/ATSAM4CMS8C_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x80000"    startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C_512.FLM"    start="0x01000000"  size="0x80000"                  default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->
        </device>

        <!-- ******************************  SAM4CMS16C  ****************************** -->
        <device Dname="ATSAM4CMS16C">
          <compile   Pname="CM4_P0" define="__SAM4CMS16C_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4CMS16C_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4CM/ATSAM4CMS16C_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4CM/ATSAM4CMS16C_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x100000"   startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C_1024.FLM"   start="0x01000000"  size="0x100000"                 default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->
        </device>
      </subFamily>

      <!-- ******************************  SAM4CM32  *************************** -->
      <subFamily DsubFamily="SAM4CM32">
        <processor Pname="CM4_P0" Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
        <processor Pname="CM4_P1" Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile   header="Device/SAM4CM32/Include/sam4cm32.h"/>
        <book name="Documents/Atmel-11203-32-bit-Cortex-M4-Microcontroller-SAM4CM32-SAM4CM16-SAM4CM8-SAM4CM4.pdf" title="SAM4CM Datasheet"/>
        <description>
Symmetrical/Asynchronous Dual Core Architecture
  - Interrupt-based Interprocessor Communication
  - Cryptography
  - Physical Anti-tamper Detection I/O
  - Security bit for Device Protection
  - Segmented LCD Controller
  - Two-phase (SAM4CMS) or three-phase (SAM4CMP) Energy Metering Analog-Front-End
  - SW Controlled On-Chip Reference ranging from 1.6V to 3.4V
  - Temperature Sensor and Backup Battery Voltage Measurement Channel
        </description>

        <feature type="ExtBus"        n="8"                      name="External Bus Interface"/>
        <feature type="UART"          n="2"                      name="UART Interface"/>
        <feature type="SPI"           n="1"                      name="SPI Interface"/>
        <feature type="ComOther"      n="2"                      name="TWI Two-wire Interface"/>
        <feature type="ADC"           n="8"       m="10"         name="ADC"/>
        <feature type="Timer"         n="6"       m="16"         name="Timer"/>
        <feature type="PWM"           n="3"       m="16"         name="Pulse Width Modulation"/>
        <feature type="WDT"           n="1"/>
        <feature type="Crypto"        n="1"       m="128"        name="AES, CPKCC, ICM (SHA), TRNG"/>
        <feature type="QFP"           n="100"                    name="LQFP Package"/>

        <!-- ******************************  SAM4CMP32C  ************************** -->
        <device Dname="ATSAM4CMP32C">
          <compile   Pname="CM4_P0" define="__SAM4CMP32C_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4CMP32C_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4CM32/ATSAM4CMP32C_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4CM32/ATSAM4CMP32C_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x100000"   startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IROM2"                      start="0x01100000"  size="0x100000"   startup="0"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x40000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C32_2048.FLM" start="0x01000000"  size="0x200000"                 default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->

          <feature type="USART"         n="3"                      name="USART Interface"/>
          <feature type="AnalogOther"   n="7"                      name="Energy Metering Analog-Front -End"/>
          <feature type="LCD"           n="1"       m="33.6"       name="Segment LCD Controller"/>
          <feature type="IOs"           n="52"                     name="General Purpose I/Os"/>
        </device>

        <!-- ******************************  SAM4CMS32C  ************************** -->
        <device Dname="ATSAM4CMS32C">
          <compile   Pname="CM4_P0" define="__SAM4CMS32C_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4CMS32C_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4CM32/ATSAM4CMS32C_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4CM32/ATSAM4CMS32C_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x100000"   startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IROM2"                      start="0x01100000"  size="0x100000"   startup="0"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x40000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x4000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C32_2048.FLM" start="0x01000000"  size="0x200000"                 default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->

