saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAM4_DFP.1.6.1.pdsc
          <feature type="USART"         n="4"                      name="USART Interface"/>
          <feature type="AnalogOther"   n="4"                      name="Energy Metering Analog-Front -End"/>
          <feature type="LCD"           n="1"       m="38.6"       name="Segment LCD Controller"/>
          <feature type="IOs"           n="57"                     name="General Purpose I/Os"/>
        </device>
      </subFamily>

      <!-- ******************************  SAM4CP  ****************************** -->
      <subFamily DsubFamily="SAM4CP">
        <processor Pname="CM4_P0" Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>
        <processor Pname="CM4_P1" Dfpu="1" Dmpu="0" Dendian="Little-endian" Dclock="120000000"/>
        <compile   header="Device/Include/SAM4CP/sam4cp.h"/>
        <description>
Symmetrical/Asynchronous Dual Core Architecture
  - Interrupt-based Interprocessor Communication
  - Cryptography
  - 4 Physical Anti-tamper Detection I/O
  - Security bit for Device Protection
  - Segmented LCD Controller
  - PRIME 1.4.0 PLC Modem
  - SW Controlled On-Chip Reference ranging from 1.6V to 3.4V
  - Temperature Sensor and Backup Battery Voltage Measurement Channel
        </description>

        <!-- ******************************  SAM4CP16B  ****************************** -->
        <device Dname="ATSAM4CP16B">
          <compile   Pname="CM4_P0" define="__SAM4CP16B_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4CP16B_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4CP/ATSAM4CP16B_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4CP/ATSAM4CP16B_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x100000"   startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C_1024.FLM"   start="0x01000000"  size="0x100000"                 default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->

          <book name="Documents/doc43051h.pdf" title="SAM4CP16B Datasheet"/>
        </device>

        <!-- ******************************  SAM4CP16C  ****************************** -->
        <device Dname="ATSAM4CP16C">
          <compile   Pname="CM4_P0" define="__SAM4CP16C_0__"/>
          <compile   Pname="CM4_P1" define="__SAM4CP16C_1__"/>
          <debug     Pname="CM4_P0" svd="SVD/SAM4CP/ATSAM4CP16C_0.svd"/>
          <debug     Pname="CM4_P1" svd="SVD/SAM4CP/ATSAM4CP16C_1.svd"/>
          <memory    Pname="CM4_P0" id="IROM1"                      start="0x01000000"  size="0x100000"   startup="1"   default="1"/>
          <memory    Pname="CM4_P0" id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <memory    Pname="CM4_P1" id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory    Pname="CM4_P1" id="IRAM1"                      start="0x20100000"  size="0x2000"     init   ="0"   default="1"/>
          <algorithm Pname="CM4_P0" name="Flash/ATSAM4C_1024.FLM"   start="0x01000000"  size="0x100000"                 default="1"/>
          <!-- P1 has no Flash Alg, because IROM1 is RAM, ROM Code for P1 gets copied from P0 to SRAM for P1 -->

          <book name="Documents/doc43080f.pdf" title="SAM4CP16C Datasheet"/>
        </device>
      </subFamily>
    </family>

  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="SAM4E">
      <description>Microchip SAM4E Devices</description>
      <require Dvendor="Microchip:3" Dname="ATSAM4E*"/>
    </condition>

    <condition id="SAM4L">
      <description>Microchip SAM4L Devices</description>
      <require Dvendor="Microchip:3" Dname="ATSAM4L*"/>
    </condition>

    <condition id="SAM4N">
      <description>Microchip SAM4N Devices</description>
      <require Dvendor="Microchip:3" Dname="ATSAM4N*"/>
    </condition>

    <condition id="SAM4S">
      <description>Microchip SAM4S Devices</description>
      <require Dvendor="Microchip:3"/>
      <accept  Dname="ATSAM4S16*"/>
      <accept  Dname="ATSAM4S8*"/>
      <accept  Dname="ATSAM4S2*"/>
      <accept  Dname="ATSAM4S4*"/>
      <accept  Dname="ATSAM4SA16*"/>
      <accept  Dname="ATSAM4SD16*"/>
      <accept  Dname="ATSAM4SD32*"/>
    </condition>

    <condition id="SAM4SP">
      <description>Microchip SAM4SP Devices</description>
      <require Dvendor="Microchip:3" Dname="ATSAM4SP32*"/>
    </condition>

    <condition id="SAM4C">
      <description>Microchip SAM4C Devices</description>
      <require Dvendor="Microchip:3"/>
      <accept  Dname="ATSAM4C4*"/>
      <accept  Dname="ATSAM4C8*"/>
      <accept  Dname="ATSAM4C16*"/>
    </condition>

    <condition id="SAM4C32">
      <description>Microchip SAM4C32 Devices</description>
      <require Dvendor="Microchip:3" Dname="ATSAM4C32*"/>
    </condition>

    <condition id="SAM4CM">
      <description>Microchip SAM4CM Devices</description>
      <require Dvendor="Microchip:3"/>
      <accept  Dname="ATSAM4CMP8*"/>
      <accept  Dname="ATSAM4CMP16*"/>
      <accept  Dname="ATSAM4CMS4*"/>
      <accept  Dname="ATSAM4CMS8*"/>
      <accept  Dname="ATSAM4CMS16*"/>
    </condition>

    <condition id="SAM4CM32">
      <description>Microchip SAM4CM32 Devices</description>
      <require Dvendor="Microchip:3" Dname="ATSAM4CM[PS]32*"/>
    </condition>

    <condition id="SAM4CP">
      <description>Microchip SAM4CP Devices</description>
      <require Dvendor="Microchip:3" Dname="ATSAM4CP*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="SAM4E CMSIS">
      <description>Microchip SAM4E Devices and CMSIS-CORE</description>
      <require condition="SAM4E"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SAM4L CMSIS">
      <description>Microchip SAM4L Devices and CMSIS-CORE</description>
      <require condition="SAM4L"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SAM4N CMSIS">
      <description>Microchip SAM4N Devices and CMSIS-CORE</description>
      <require condition="SAM4N"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="SAM4S CMSIS">
      <description>Microchip SAM4S Devices and CMSIS-CORE</description>
      <require condition="SAM4S"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

